app/controllers/bars_controller.rb

SELECT "bars".* FROM "bars"
---
  def index
    @bars = Bar.all

SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_bar
      @bar = Bar.find(params[:id])