app/controllers/favorites_controller.rb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_favorite
      @favorite = Favorite.find(params[:id])