app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    profile = Profile.find(params[:id])

INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 3], ["created_at", "2016-04-29 00:49:22.262819"], ["updated_at", "2016-04-29 00:49:22.262819"]]
---
  def create
    @profile = Profile.new(profile_params)

    if @profile.save

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "profiles" SET "pic" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["pic", "test"], ["updated_at", "2016-04-29 15:47:04.786715"], ["id", 1]]
---
  def update
    @profile = Profile.find(params[:id])

    if @profile.update(profile_params)